benchmarks/results/auth-serialization/test-serialization/test-pydantic/wrk2-logs/run_1_1305_1147.txt
Running 30s test @ http://127.0.0.1:8000/serialization-pydantic
  2 threads and 6 connections
  Thread calibration: mean lat.: 7.864ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 7.682ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.89ms   10.84ms  91.01ms   95.60%
    Req/Sec   309.14     64.78   500.00     57.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.79ms
 75.000%    6.55ms
 90.000%    8.81ms
 99.000%   72.32ms
 99.900%   87.17ms
 99.990%   90.82ms
 99.999%   91.07ms
100.000%   91.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.049     0.000000            1         1.00
       3.673     0.100000         1201         1.11
       3.983     0.200000         2400         1.25
       4.435     0.300000         3602         1.43
       5.559     0.400000         4802         1.67
       5.787     0.500000         6009         2.00
       5.939     0.550000         6597         2.22
       6.079     0.600000         7206         2.50
       6.231     0.650000         7809         2.86
       6.355     0.700000         8410         3.33
       6.551     0.750000         9001         4.00
       6.735     0.775000         9300         4.44
       8.263     0.800000         9603         5.00
       8.423     0.825000         9908         5.71
       8.559     0.850000        10198         6.67
       8.671     0.875000        10506         8.00
       8.743     0.887500        10648         8.89
       8.815     0.900000        10803        10.00
       8.943     0.912500        10951        11.43
       9.095     0.925000        11102        13.33
       9.375     0.937500        11245        16.00
       9.519     0.943750        11324        17.78
       9.911     0.950000        11395        20.00
      19.247     0.956250        11470        22.86
      29.199     0.962500        11546        26.67
      39.263     0.968750        11620        32.00
      43.999     0.971875        11657        35.56
      49.087     0.975000        11695        40.00
      53.951     0.978125        11732        45.71
      59.167     0.981250        11770        53.33
      63.839     0.984375        11807        64.00
      66.175     0.985938        11826        71.11
      68.799     0.987500        11845        80.00
      70.911     0.989062        11863        91.43
      73.535     0.990625        11882       106.67
      75.839     0.992188        11901       128.00
      77.375     0.992969        11911       142.22
      78.527     0.993750        11921       160.00
      79.935     0.994531        11930       182.86
      81.151     0.995313        11938       213.33
      82.367     0.996094        11948       256.00
      82.943     0.996484        11953       284.44
      83.519     0.996875        11957       320.00
      84.351     0.997266        11963       365.71
      84.543     0.997656        11966       426.67
      85.119     0.998047        11971       512.00
      85.695     0.998242        11973       568.89
      86.207     0.998437        11976       640.00
      86.399     0.998633        11978       731.43
      86.655     0.998828        11980       853.33
      87.807     0.999023        11983      1024.00
      88.063     0.999121        11984      1137.78
      88.127     0.999219        11986      1280.00
      88.127     0.999316        11986      1462.86
      88.191     0.999414        11987      1706.67
      88.831     0.999512        11989      2048.00
      88.831     0.999561        11989      2275.56
      89.151     0.999609        11990      2560.00
      89.151     0.999658        11990      2925.71
      89.471     0.999707        11991      3413.33
      90.559     0.999756        11992      4096.00
      90.559     0.999780        11992      4551.11
      90.559     0.999805        11992      5120.00
      90.559     0.999829        11992      5851.43
      90.815     0.999854        11993      6826.67
      90.815     0.999878        11993      8192.00
      90.815     0.999890        11993      9102.22
      90.815     0.999902        11993     10240.00
      90.815     0.999915        11993     11702.86
      91.071     0.999927        11994     13653.33
      91.071     1.000000        11994          inf
#[Mean    =        7.893, StdDeviation   =       10.839]
#[Max     =       91.008, Total count    =        11994]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 30.01s, 0.92GB read
Requests/sec:    599.87
Transfer/sec:     31.47MB