benchmarks/results/auth-serialization/test-serialization/test-pydantic/wrk2-logs/run_3_1305_1148.txt
Running 30s test @ http://127.0.0.1:8000/serialization-pydantic
  2 threads and 6 connections
  Thread calibration: mean lat.: 8.761ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 8.236ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.52ms   10.72ms  91.52ms   95.80%
    Req/Sec   308.06     63.96   500.00     77.51%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.08ms
 75.000%    8.74ms
 90.000%    9.21ms
 99.000%   73.09ms
 99.900%   88.70ms
 99.990%   90.88ms
 99.999%   91.58ms
100.000%   91.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.963     0.000000            1         1.00
       3.657     0.100000         1202         1.11
       4.427     0.200000         2400         1.25
       4.963     0.300000         3599         1.43
       5.675     0.400000         4808         1.67
       6.079     0.500000         5999         2.00
       6.483     0.550000         6599         2.22
       8.199     0.600000         7204         2.50
       8.455     0.650000         7803         2.86
       8.615     0.700000         8405         3.33
       8.743     0.750000         9009         4.00
       8.815     0.775000         9331         4.44
       8.871     0.800000         9606         5.00
       8.935     0.825000         9939         5.71
       8.999     0.850000        10198         6.67
       9.087     0.875000        10511         8.00
       9.135     0.887500        10647         8.89
       9.207     0.900000        10808        10.00
       9.287     0.912500        10961        11.43
       9.391     0.925000        11102        13.33
       9.583     0.937500        11245        16.00
       9.703     0.943750        11321        17.78
       9.855     0.950000        11395        20.00
      17.055     0.956250        11470        22.86
      26.959     0.962500        11545        26.67
      37.695     0.968750        11620        32.00
      42.847     0.971875        11657        35.56
      47.903     0.975000        11695        40.00
      53.087     0.978125        11732        45.71
      58.143     0.981250        11770        53.33
      63.231     0.984375        11807        64.00
      66.175     0.985938        11826        71.11
      68.671     0.987500        11845        80.00
      71.487     0.989062        11863        91.43
      73.727     0.990625        11883       106.67
      76.735     0.992188        11901       128.00
      78.143     0.992969        11912       142.22
      79.103     0.993750        11920       160.00
      80.383     0.994531        11929       182.86
      81.727     0.995313        11939       213.33
      83.391     0.996094        11949       256.00
      83.647     0.996484        11952       284.44
      84.543     0.996875        11957       320.00
      85.311     0.997266        11962       365.71
      85.887     0.997656        11966       426.67
      86.527     0.998047        11971       512.00
      87.167     0.998242        11973       568.89
      87.487     0.998437        11976       640.00
      87.807     0.998633        11978       731.43
      88.319     0.998828        11981       853.33
      88.831     0.999023        11983      1024.00
      88.895     0.999121        11984      1137.78
      88.959     0.999219        11985      1280.00
      89.023     0.999316        11986      1462.86
      89.279     0.999414        11987      1706.67
      90.175     0.999512        11989      2048.00
      90.175     0.999561        11989      2275.56
      90.559     0.999609        11990      2560.00
      90.559     0.999658        11990      2925.71
      90.751     0.999707        11991      3413.33
      90.879     0.999756        11993      4096.00
      90.879     0.999780        11993      4551.11
      90.879     0.999805        11993      5120.00
      90.879     0.999829        11993      5851.43
      90.879     0.999854        11993      6826.67
      90.879     0.999878        11993      8192.00
      90.879     0.999890        11993      9102.22
      90.879     0.999902        11993     10240.00
      90.879     0.999915        11993     11702.86
      91.583     0.999927        11994     13653.33
      91.583     1.000000        11994          inf
#[Mean    =        8.515, StdDeviation   =       10.720]
#[Max     =       91.520, Total count    =        11994]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 30.01s, 0.92GB read
Requests/sec:    599.83
Transfer/sec:     31.47MB